# 衰退期 - 金融
stock_list = [
    'sh.601398',  # 工商银行
    'sh.600958',  # 东方证券
    'sh.601628',  # 中国人寿
    'sz.000617',  # 中油资本
    'sz.000001',  # 平安银行
]

# 衰退期 - 消费
stock_list += [
    'sh.600887',  # 伊利股份
    'sz.000895',  # 双汇发展
    'sh.600358',  # 国旅联合
    'sh.603099',  # 长白山
    'sz.002563',  # 森马服饰
]

# 衰退期 - 公共事业
stock_list += [
    'sh.600028',  # 中国石化
    'sh.601390',  # 中国中铁
    'sh.600039',  # 四川路桥
    'sz.000961',  # 中南建设
    'sz.000002',  # 万科A
]

# 复苏期 - 周期
stock_list += [
    'sh.600118',  # 中国卫星
    'sh.600072',  # 中船科技
    'sh.600776',  # 东方通信
    'sh.601727',  # 上海电气
    'sh.601186',  # 中国铁建
]

# 过热期 - 互联网
stock_list += [
    # 请在此处填写过热期互联网股票代码
]

# 滞涨期 - 科技
stock_list += [
    'sz.000063',  # 中兴通讯
    'sz.002463',  # 沪电股份
    'sz.000725',  # 京东方A
    'sz.002432',  # 九安医疗
    'sh.600588',  # 用友网络
]

# 滞涨期 - 新能源
stock_list += [
    'sz.002245',  # 蔚蓝锂芯
    'sz.000807',  # 云铝股份
]
# 基准
stock_list += [
    'sh.000001'
]